tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "yt-dlp/taps"
# Core application library for C
brew "glib"
# Cluster ssh tool for Terminal.app
brew "csshx"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Integer Set Library for the polyhedral model
brew "isl"
# GNU compiler collection
brew "gcc"
# GIF image/animation creator/editor
brew "gifsicle"ß
# SDK for Groovy: a Java-based scripting language
brew "groovysdk"
# Extendable open-source CI server
brew "jenkins-lts", restart_service: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source distributed event streaming platform
brew "kafka"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Development kit for the Java programming language
brew "openjdk@8"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Command-line time tracking application
brew "timewarrior"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# Download YouTube videos from the command-line
brew "youtube-dl"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A youtube-dl fork with additional features and fixes
brew "yt-dlp/taps/yt-dlp"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-fira-code"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open source relational database management system
brew "mysql"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Search tool like grep, but optimized for programmers
brew "ack"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11", link: false
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# X.509 and CMS library
brew "libksba"
# YAML Parser
brew "libyaml"
# Data loading tool for PostgreSQL
brew "pgloader"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-shell prompt for astronauts
brew "starship"
# UNIX shell (command interpreter)
brew "zsh"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Universal database tool and SQL client
cask "dbeaver-community"
cask postman
cask notion